In [1]:
import numpy as np
import pandas as pd

In [9]:
d = {'A':[1,np.nan,4],'B':[3,6,8],'C':[12,np.nan,np.nan]}
df = pd.DataFrame(d)

In [10]:
df

     A  B     C
0  1.0  3  12.0
1  NaN  6   NaN
2  4.0  8   NaN

In [11]:
df.dropna()
#eVEN IT REQUIES INPLCE

     A  B     C
0  1.0  3  12.0

In [12]:
df

     A  B     C
0  1.0  3  12.0
1  NaN  6   NaN
2  4.0  8   NaN

In [13]:
df.dropna(axis=1)

   B
0  3
1  6
2  8

In [15]:
df.dropna(thresh=2)
#Minimum 2 nan required

     A  B     C
0  1.0  3  12.0
2  4.0  8   NaN

In [16]:
df.fillna('FILLER')

        A  B       C
0       1  3      12
1  FILLER  6  FILLER
2       4  8  FILLER

In [19]:
df.fillna(value=df.mean())

     A  B     C
0  1.0  3  12.0
1  2.5  6  12.0
2  4.0  8  12.0

# Groupby

In [21]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [23]:
df=pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [27]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [29]:
df.groupby('Company').std().loc['FB']

Sales    75.660426
Name: FB, dtype: float64

In [31]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [34]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0